["A single lung is worth more than an average slave and you can get at least 1 kidney, 1 lung and 1 heart per prisoner. A dismantled slave is like 4 times the value of a complete one and you can eat what is left.", "\"The child was born, immediately went to equip marine armor and then smoke a joint. I guess being a fetus didn't provide much recreation.\"", "Well you can torture your prisoners in new ways. I cut a guy's dick off and fed it to him. I do question myself sometimes. In a mental break he then tried to rape another prisoner. Problem was the other prisoner was stronger and in turn raped him instead. I shot them both out of obligation", "I use children to haul and tend to my injured because their pain tolerance is too low for combat. They could be useful if you have alot of them and enough SMGs to equip them all. Nine three-year olds with Uzis will always beat three nine-year olds armed with bolt action rifles in close combat.", "\"I like to give all my prisoners a fat rack and then drop pod them back to their faction. Can only imagine what it’s like for them to return home completely intact aside from a new huge mechanical set of breasts\"", "\"It's called the 'Rimworld' Hokey Pokey. You cut the left arm off, you sew the left arm on, you cut the left arm off, then you shake it all about! You cackle like a madman as the patient passes out! THAT'S WHAT IT'S ALL ABOUT!\"", "Does anyone beat up slaves they want but cannot afford in the early game? I just bought an otherwise healthy Industrious rim with major passions and high (8+) Intellectual, Medical, Construction and Crafting. Original price 1575 Silver, After I beat the shit out of him with a gun butt, 330 silver.", "Fun tip next time you need relations with a faction and you have one of their people: You can get higher a higher relation bonus by removing all organs from the person and sending it all back to the faction. They like the body parts more than the person.", "Some miner miscommunication", "“Accidental CIA I found that the best way to get someone to abandon their ideologie is to overheat their room, keep them starving (but not too much) and every so often to beat them. They’ll have so many mental breaks they’ll drop that stupid tribal ideologie in a jiffy”", "This terrifying prisoner breeding tank", "Does tasing babies not stun them? Or does my colonist keep missing as he has no eyes?", "The fanciest meals have only two ingredients. Those ingredients are probably corn and whatever animal last tried to break down my door.", "Does press-ganging 15-16 year olds from enemy factions, giving them AKs, and having them snort coke and fight giant alien insects count as having child soldiers?", "\"So the traders won't buy a piece of clothing that was on a dead guy, but they WILL buy clothing made FROM the same dead guy. \"", "\"When I was still using pawnmorpher I captured two enemy faction leaders alive, morphed them into bovids and kept them locked away milking them for years until they went insane. One of them had good stats so I cloned her and her human clone was her sole caretaker and milker.\"", "All of my child soldiers have killed their parents, both to test that their desensitized trait works and also to symbolically kill of their old lives and begin anew as unthinking, uncaring, members of the 2nd killsquad.", "Cows are so productive they break Newton's laws. So long as cows are efficiently fed, the heat death of the universe can't occur. Get a cow.", "I’ve drafted my entire colony to beat a woman within an inch of her life several times and had her pre-approved spouse tend her, just for the relationship increase.", "“What mighty warrior or lord is buried in this glorious tomb?” “Oh that? That’s Jeff. We keep him there just in case Eli cracks a shit and feels the need to fondle a corpse every now and then.”", "Does give a lesbian a wooden penis improve or worsening sexual pleasure of the partner?", "\"Other than Incest being a permanent negative relation with other pawns, there are no problems of doing that on Rim. Infact, the marriage tends to be more stable as they have a perma relation bonus between themselves due to blood relations (for example sibling is +20 so you need only 80 more for 100", "No one will buy my fucking hats! You jackasses told me to make hats out of the dead. I did. I’ve got hundreds of fucking hats taking up space in my room. I can’t find a single place who buys cowboy hats! None of the towns nearby are willing to buy my fucking hats.", "Rectal Arrow Procedures", "Dude got married, cheated on his wife, and divorced them. Several different times with several different women. The debuffs to mood were so bad eventually I had the his first wife arrest him, his third wife harvest his organs, and his second wife turn him into kibble to feed to the huskies.", "“Furries have fur everywhere. Cat-girls have skin on most of their body. As a veteran of [Rimworld], I assure you the difference is significant. Especially for hat-making.”", "“Weed addicted 6 years old in rehab got shot through the brain after plummeting a granny caretaker due to a withdrawal.”", "I don't care if you're white, Black Red or Blue. If you have a working Liver; I'm coming for you.", "We 'de-spined' (him) as a safety precaution, harvested a few of his organs, and when it came time for our tri-yearly public execution, we popped his spine back in and started the execution. He was still upset over the organ harvesting.", "TFW you buy a young slave colonist from a caravan and he looks suspiciously like that raider you impregnated and released 15 years ago.", "Never waste a good corpse. I have a dedicated freezer that my colonists are not allowed to enter. The dogs haul the corpses in and feed on them as needed. Raids have essentially become uber eats for my pack of dogs", "Anyone else accepts refugees just for forced labour in the mines and then turn them into food for winter before they depart?", "“I've been hunting for a good masochist prisoner for a while now. Plan is to enslave him, inflict a ton of torture to get the persistent highest masochist mood buff, install a joywire and a harmonizer, thus making him a little beacon of pain-happiness for all my colonists […]”", "invaluable opportunity", "I never used the forbidden mod in conjunction with other things I stopped using it when my pawns started raping the horse out of nowhere even though there were prisoners there and they didn’t actually like animals.", "At what age do kids stop dying from trying drugs? ... I've now had 2 children with chemical interest who try drugs and die instantly. At what age can I give the most recent one his legs back?", "Using dubs bad hygiene, I flood my kill box with shit and as much waste as I possibly can. The kill box is always heated to 150 F, and is guarded with refugees when I have them. Otherwise, I flood the thing with helixigen gas so that the raiders die in a vat of boiling shit unable to breath.", "\"I play this game for the same reason I play CK3. Not to win, but to do stuff which would get me imprisoned in real life.\"", "Theory proven, the necrotic, organless husk we keep in the prison cell, can in fact get pregnant", "I've figured out you can make a self sustaining burnbox using bodyheat alone.", "Im sure the wife won't mind you keeping lobotomized women in a dirt hut, with their arms and legs cut off, eyes gouged out, ears, nose, tongue and jaw cut off, and using them to only \"naturally\" incubate children, which some you will eat and some enslave, and some recruit", "One time a traitor turned at night in their room. I forbid the door, so they set something on fire. In a wood-floored room of a stone building. Some people just weren't meant for life, I guess.", "I once had a bad combination of the “children and learning” and “Rimsenal” mods. Children and learning can cause raids to spawn with child pawns. Rimsenal has suicide bombers. I had a Mental Break: Catatonic after that one.", "I always keep a prisonner without spine around, they dont cause any problem and if im missing any parts, they are right here with their spaghetti noodle back", "(RJW) I’m using prisoners I removed spines from as prostitutes right now and want to know what kind of layout I should use for my whorehouse.", "A smokeleaf joint administered to a 2 year old gives so much tolerance that they are 4 years old by the time it wears off. Yes I drugged a lot of kids", "I put a mindscrew and a psychic harmonizer in a prisoner in a cramped 2x2 cell set at 33C in an attempt to turn him into a sort of \"beacon of agony\" to project a powerful mood debuff on attacking raids. [...] However, [...] it didn't work, and I ended up [...] harvesting his liver.", "\"Is there a way to turn slaves into suicide bombers\"", "\"Racism will be available in the next update\"", "Man, poor Fritz... Do they remember him as Fritz the wall builder? No. Do they remember him as Fritz the guy who was unbeatable at horseshoes? No, they don't. It seems if you fuck even just one megascarab, suddenly you are Fritz the megascarab fucker until the end of time.", "New player here. I needed to use the restroom and forgot to hit pause. Came back to this ghastly sight. Apparently my priest tried to convert a giant alpaca with a saw-blade on its head into our sexual hippie drug cult.", "\"Limbs are for people that don't raid me.\"", "Two prisoners of mine have fallen in love and want to get married. Will this prompt an event anytime before my annual cannibal feast I’ll be serving them at?", "“MY TURTLES KEEP SLEEPING IN THE FREEZER. THEY WON'T STOP DYING OF HYPOTHERMIA.”", "“I remember i held a trial for this one guy who continuously raided us, and they lost because i cut out their tongue the day before. I love the justice system.”", "That's why you send everyone but your local psycho on a nice walk around town (caravan). When they come back, there will be significantly fewer prisoners but more organs and a surprising amount of soft leather.", "Sun Tzu said: \"When you are strong, appear weak. When you are weak, farskip colonists in, get the supersoldiers out of the cryptosleep, enslave those melee gods you've been keeping at 0 will for such an occasion, and fuck shit up.\"", "man mod; allows consumption of man; more man is more power; eat 100 people to gain the ultimate man powers; trying to consume yourself creates a singularity and crashes the game; every time you eat a man it generates an error, but is probably fine; literally hundreds of bugs, never gonna fix lol", "\"Also, if a pregnant woman gives birth on the battlefield her child can just pick a gun and fight alongside her\"", "I forgot to feed my slaves and they ate the corpse of the first one to starve.", "\"Even though i beat my prisoners regularly, i haven't gotten them to commit suicide.\"", "Condition: Too many mods. Symptoms may include low fps, crashes and tumbleweed having sex.", "\"I once had all of my prisoners living off of eggs I forced a limbless prisoner to make using an egg implant. The prisoner was sat in the middle of the jail and they would all swarm him and his eggs when they were hungry.\"", "A 7 year old fell out of the sky and I don't want him but I feel like I shouldn't just kill and eat him", "“So i left the cooler on in my pig pen and some pigs got frostbite on their hoofs and can't walk anymore, can they still get pregnant or should i slaughter them?”", "People keep beating the shit out of my blind, brain-damaged colonist. How do I stop it", "Type 1 player: \"My brutal Randy -40c ice sheet cannibal had his penis ripped off as an eldrich horror manhunter pack. I just had my slave labour human leather hat factory up and running too.\" Type 2 player: \"I built Dublin Castle, but I added some comfy rooms for my guys.\"", "I'm deliberately trying to be the nice guys here with charity and nonviolence, but even I installed C4 charges in the refugee barracks just in case these bastards snap and decide to betray us.", "Children should never be given firearms, it's just wrong. They're much better suited to crew-serviced weapons.", "Actually, smokeleaf seems to be ok from what I’ve noticed after forcing a child pawn to smoke a couple of joints after their mom died", "\"My slaves, which i use as incubators to produce child soldiers, are so happy they get inspirations. \"", "Human bodies are pretty terrible barricades, you should use human-skin sandbags since packed sand is better at stopping bullets than mushy human insides", "\"I put my slave's wife's corpse in a cage next to his bed :)\"", "You have a steam geyser in your fucking fridge", "removed child's heart, but for some reason she's not dead", "Give a man a fire, and he’s warm for a day. Set a man on fire, and he’s warm for the rest of his life.", "Playing with CE and legit children with heavy weaponry is a real combo, toddlers can handle suppressing fire decently enough and they can be acquired in great numbers, so i tend to stick them behind cover so they can support the main adult force. Also nets them a nice set of skills that they can use", "I prefer suicide belts for children because it’s cheaper and it allows me to eradicate weak genes from the population.", "how do I stop my slave from fucking all the colonists?", "Imagine this, we have 10 prisioners, we make them pregnant and harvest the child organs, 350 of profit, then we make the child mine or craft components until he is 14 and then sell it by 500 silver", "I had a colonist named Gnugfur once and he cheated on his wife. I proceeded to use one of my dubious medical mods to have her surgically transform Gnugfur into a biological woman; womb and all. He wasn't very pleased about it when he woke up.", "Are body types purely cosmetic, or do they actually influence how much of meat comes from the person when you butcher them? And are there any genes that could increase the meat yield?", "Abortions are meta?", "I wish I had an immortal guinea pig to practice my hand to hand combat on. So what it screeches. Nothing will be more satisfying than one hit punching someone's face off after hours of smacking the little furry hacky sack.", "\"Kidnapped another factions leader. Removed all his limbs so he couldn't fight me or be a part of a prison break, and removed his tongue so he couldn't sass me. But he kidnapped one of my people. So seems fair in my book\"", "If I cut off this jerk's tongue will he stop insulting me? And if he can still insult me with hand gestures will cutting out his hands stop that?", "“Pro tip for pregnancy, it can severely disable a colonist which is why you should make slaves carry the children for you.”", "\"This just makes me want to dope up each prisoner until they're addicted to everything and then release them, so they become walking drug Piñatas when they return in a raid.\"", "Running a cannibal hotel called Five Guys because it is what they will have on their plates.", "It has been 2 months since Biotech was released and we still don't have a baby mortars/launchers mod yet", "Legs are a privilege, not a right. When they're off smack, they get their legs back.", "\"So can we kill and eat the babies? I want to have a colony survive entirely on slave babies. Hell, id even sell a few for some nicer clothes.\"", "\"Why would they ever ban a game that will let me force feed cocaine to an infant?\"", "Call me a prude if you like but my colonists gang raping a dying enemy pawn who’s bleeding out from getting their leg blown off is a level of immersion I can do without.", "is it a war crime to have a human farm for the purpose of killing the babies and feeding them to prisoners", "If you butcher a pregnant animal do you get more meat since it carries an unborn fetus?", "Will megaspiders be renamed spiders in the Australian version?", "Baby chick hatched, immediately drank a whole bottle of vodka, then blacked out for over a week. He should be fine", "Whenever I have a masochist who's upset, I just shoot them. Works every time.", "Pigs eat raiders, we eat pigs. It's not cannibalism if there're extra steps.", "\"I'm gonna turn Harvey Weinstein into a living factory. I'm gonna put him in a coma, give him a jelly sac and ovipositor so he produces eggs and insect jelly. Then, I'm gonna stuff him in a rumsuit so his greasy sweat makes rum every ten days. Oh, and he's gonna be administered poop wine\"", "I Just Sold 76 People Into Slavery Because I Have Nothing Better To Do With My Life", "Fortunately, the cats will eventually eat the dead cats. A room full of 100 cats can survive self-sustainably, provided you can provide enough booze", "Human skin hats are wholesome and Christian, but if I even hear about sex in my game, I’ll lose my mind.", "The nearest imperial town had love enhancers in stock for just a few more days and I was a bit short on cash. So I killed a prisoner for his heart just to let my pawns have better sex.", "i have 2 Female Prisoners and i impregnated both of them via Artifical Impregnation Operation, and added and removed Peg legs to both of their Legs, to prevent them from breaking, potentially harming their Children.", "I want a baby drug mod, that lets you split drugs into 5 druglets, which are a save dosis for babies", "Can a bull fuck a brain dead cow?", "Adult colonist broke and decided to kill a 9yo girl. Girl punched him in the dick so hard his pelvis broke.", "Can I force-feed a prisoner I have human meat until he breaks and becomes a cannibal? Or should I just eat him?", "I think the war crimes expanded mod has an operation where the doctor stabs a patient in the brain to try to artificially turn them into a trauma savant. Obviously, it fails alot.", "\"Pro rimworld tip. Always get distinctive tattoos so loved ones can identify you whilst looking at leather hats.\"", "You must not keep more than 3 human corpses in your freezer unless one of them are your family members waiting for revival serums.", "How do i stop my slaves from running for mayor?", "One favorite is to assign a prison hospital bed as your learning Hospital and have all your lowest skilled medical pawns continuously take out and replace organs until the patient dies. If they don't die by the time the Royal tribute guy gets there you give it to him", "My one slave in the colony gets a giant mood debuff from “having a slave in the colony” due to her religion. Except, well, she is the slave.", "Are we going to see a mod that makes shooting babies from a mortar possible?", "\"If a body completely decays on regular soil, it should turn into fertile soil.\" and \"Would this be a vegetarian version of cannibalism?\"", "\"If you say... implant a slave with one and sell them.. can you detonate them in the middle of the trading caravan remotely if they're still on your tile? And if you can... does that register as an attack from you? Asking for a friend.\"", "Finally, the baby mortar mod has arrived!", "So I abused this thrumbo, I killed its partner, and I used her as a target and medical practice daily for my pawns, but she got scarred so bad she's basically a vegetable now", "Does removing limbs reduce nutrition need? If I cut the legs and arms off of a prisoner will they require less food than someone fully intact?", "I don't think you understand. The ocean wasn't named after Ivan's mistake. Ivan made a mistake, and the consequence was the formation of a large ocean.", "\"Is there a mod that allows forcing prisoners to beat fellow prisoners to death, then make the winner eat its own organs, then beat whats left to death with a shotgun stock?\"", "I make \"rehab\" facilities, which is a triple thick granite box with no doors full of packaged survival meals. They emerge free from withdrawal and addiction (sometimes catatonic)", "\"My only man is a misogynist in a world full of women, how do i fix it?\"", "This mf dared and attacked Rubber (my favorite colonist) so I assigned the worst doctor to remove his balls and she failed twice now. I'm still mad, any other torture method in the comments will be performed", "I use pit fights to offer captured pirates a chance to earn citizenship (and bionics) - usually I make them fight naked with the most damaging cutting weapons I can make, and pump them full of go juice", "Turns out you can beat or drug a prisoner before their trial to help secure a conviction", "It’s good quality, because it’s made out of a good boy.", "Ok, is it possible to keep a wild human reserve? Can I pen them in on a ranch to prevent them from wandering off the map. Just curious. Mine just keep dying of cold in winter.", "I can't host a burial ceremony because the corpse refuses to attend it due to extreme temperature", "You put the right lung in, you take the right lung out, you put the right lung in and shake it all around!", "How many rats would you have to have for them to breed faster than they can eat eachother?", "\"Wtf do I do when I run out of condoms for him to eat?\"", "Children are unable to do many types of work. So cremating dead raiders becomes one of their primary jobs.", "So my slaves are done harvesting all the eggplants, and not including the ones that may or may not have been made into fine meals, I have 2601 Eggplants. I am literally a guy from a math problem.", "(RJW) If I cut off a dogs dick and put it on a colonist, will the colonist have a dog dick and will they be able to impregnate another colonist?", "Harvesting the organs of a prisoner and give him a human leather hat with skin of his dead sister is kinda cute.", "\"I think -25 mood debuff isn't enough, I know that whenever I'm forced to eat without a table I'm halfway to the noose before I snap out of it.\"", "Using my kid to bury the dead because their mood is so high. Morally acceptable?", "\"There wasnt a famine or anything, we actually had plenty of food, but I wanted to try something and they had children.\"", "Through the power of medicine, I have successfully made a jackass who crippled my favorite warg willing volunteer into the closest approximation of a human beehive, with all limbs,eyes, and tongue removed,jelly sac(from vanilla expanded) to produce insect jelly, and a mindscrew to simulate the pain.", "I can excuse mountains of corpses and rivers of bile and blood, but I draw the line at unsymmetrical architecture.", "Are the colonists too weak to be useful? Enemies coming to raid you are not interesting? This mod will probably solve all of your problems! This mod adds a surgery and an item to insert a bomb into the brain. Pawns with bombs in their brains will explode when they die! The process is simple!", "\"Remove the teeth, bones and any other hard parts. Feed the remaining flesh into a large blender. Strain all lumps out of the resulting mush and feed to your pigs and prisoners. The strained liquid can then be easily funneled into bottles. Wait, what? Oh, you said shuttles.\"", "I wish there was a mod where I could build using the frozen corpses of my enemies.", "Can prisoners breed and would it be viable to gift babies en masse to hostile factions?", "I don't really want to execute a 13-year-old girl but I mean the law is the law", "\"Pawns should consider that hand privileges are only twice as hard to revoke as tongue privilege before making rude gestures.\"", "Once human skin is tanned to leather it more or less looks the same. Some shades need a bit more work to patina properly, but even the lightest shades can become a beautiful brownish red Chesterfield couch. Thank you for coming to my TED talk", "I guess you could kill them and have somebody eat their head and use a mech revive serum and that would get rid of the dementia.", "Researcher steals clothes from disabled prisoner and breaks his ass with an ak-47. what should I do to the researcher?", "Bought 12 human eggs and 19 days later when i had completely forgot about them i came back to 12 babies needing rescued", "Welcome to the Rim. Would you like human leather cowboy hats or nugget sex slaves?", "As they collapsed,cows gave birth.The new calves didnt die from heatstroke,the explosions from the boomalopes ignited the hay and roasted them alive.I love the smell of burning calves,still coated in amniotic fluid as their mother and siblings lie around them,with brains literally fried in the skull", "\"Yooooooo that would be awesome. Have cripples fight each other and call it “The Great veggie war”. God the thought of that gets me going..\"", "I tried hold a funeral but my chef chopped up the deceased before I had a chance :c", "\"Solving gay is easy. Just shoot them until the scars reduce their atractiveness\"", "I’m disappointed. I administered a pipe of flake to my pregnant cat Didi but despite 3 belly kittens sharing the hit she overdosed (and survived) but she didn’t get addicted. I will start a cat brewery then for the little shits", "Sometimes the game produces great stories like this, other times you get a cannibal sensually whispering to a llama about capitalism in an effort to tame it.", "Mod idea: Cum rifle. Does no damage, but has 20% chance to impregnate female pawns hit by its user.", "And as My grandpa layed before me on his death bed he closed his eyes and his heart monitor slowed. Almost in unison the family stood up and begin tearing the bitchin masterwork human leather slave collar off his still neck. Amen rimworld", "\"you like this dress? It's made entirely out of scrotums; it reacts to temperature\"", "Im looking for a mod that allows human females to be milked like a cow.", "One of my colonists insulted my super-soldier living weapon colonist's origin then a social fight happened", "Should I kidnap this 6 year old?", "\"Yep, it’s so realistic that my planet-renowned doctor failed to excise a small lung tumor, and instead stabbed the patient multiple times in the head.\"", "I am not racist, but i have killed because of skin color :(", "If you don’t have prison labor I recommend trying to get chicken morph and cow morph prisoners since their eggs and milk can be sold for quite a bit. Chickens will be easier early on since they lose a lot of their manipulation with their wings.", "You can sneak a little bit of human meat into your colonists’ food and they won’t notice.", "\"I ended up solving this by installing Simple Slavery and keeping an immobile lobotimised slave around to make sure my robots can keep building.\"", "This is peak Charity Colony here. I had some pesky refugees that liked my colony so much they wanted to stay and join life here. So instead I'm building a space ship just to launch the undesirables. If colonists have to die for it, so be it. I just wanna reduce headcount in a \"nice\" way.", "“after you joywire them you can also put in a psychic harmonizer, amputate all their limbs, and then leave them in a comfy bed in the center of the colony”", "Pro-tip: if you swap their left and right lungs they'll breathe backwards!", "\"The Neanderthals are oppressing my civilization by not dying\"", "\"We could install the mod that should not be named and just send cannibalistic horny hungry raiders with bionic penises after him.\"", "\"It's only gay if the skin of their penises is sewn together in the duster.\"", "My doctor is eating the birthed children.", "He literally punched to death his own father in front of his dying mother to eat father's corpse because of starvation.", "Is it better to harvest organs from children or theyre still gonna be the same quality as the adults?", "Can I harvest prisoner's organs, reattach them, and then harvest them again?", "I accidentally made a rat incest box, what do I do with it?", "You really need to get a good seal. Once your lips are firmly around the eyesocket, increase suction until you feel the eyeball move outward and towards your teeth. When you feel enough of the eyeball has passed the tips of your teeth, clamp down firmly. Congratulations, you've bitten an eyeball out", "Are there any drawbacks to lobotomizing my slaves?", "A meteor broke the wall of my stockpile, so the chicks got in and now they are all blacked out drunk", "Turns out, I had never assigned anyone to warden since I moved him to the new room. So for atleast around a half a year he survived exclusively or almost exclusively ON HIS OWN BLOOD.....", "Hi! Uhm, first time asking something like this, buuuut is it normal for children (from another mod) to just... die? Not spontaneously, but when I try to sew their mouths shut! | can understand a higher death rate for children, sure, but my doctor is max level and EVERY time the child dies. (Cont.)", "You can postpone the wedding if you shoot the bride with a beanbag shotgun", "\"I just capture them all, force them to work with prison labor, recruit the good ones and sell the ones I can’t use for anything. It’s a lot cheaper than treating them well.\"", "“Can you feed pets luciferium? I am not in any danger, i just want to know if i could feed my pet grizzly some luciferium before letting it go fuck some shit up during a raid?“", "Tried resurrecting a hologram pawn and accidentally made an invincible immortal bloody pile of screaming organs who won't move and constantly dies and ressurects.\"", "How many infants can a lactating slave feed?", "\"I'm imagining an amputee masochist in a thorn crown and slave attire on a slab bed in the middle of a colony with a psychic harmonizer. Everyone is vibing and feeling good. Only a few know that it's coming from the victim locked in the closet between the dining hall and the recreation room.\"", "A colonist turning into one is a bummer. But turning a prisoner of war into a murderous spider monster to kill his friends that come trying to save him, would be a real Rimworld experience", "I'll have too many mods when my PC starts spitting fire. Then, and only then.", "“Is it more efficient to be kind to prisoners or beat them to an inch of their life?”", "Around how many rats do I need before they can sustain themselves off of the corpses of the others when they starve to death?", "\"i removed parts of their brain so they don't ever turn against me, and i also am having them grow their own food, so if a harvest fails, they both starve\"", "I believe the \"atrocity scale\" officially starts at \"ate without a table\"", "\"The most viable weapon for hunting squirrels is the minigun\"", "i use legless women without tounges for reproducing. so many nice babies without the troubles of pregnancy.", "I feel less awful making school age children work, but something about making toddlers do any work feels nasty and exploitative. Especially when considering the fridge horror of slave babies and how they were brought about.", "\"I like to invade bases... I just take the female pawns and kill the male ones... you can force your slaves and prisoners to become prostitutes and earn a steady amount of silver\"", "I'm not exploiting my workers, they just choose hard work over hard beatings.", "\"The blood of so many raiders was spilled over the soil, its only natural the plants would get a taste for it.\"", "Help, my warden has completely stopped suppressing my slave", "If they aren't bonded, they aren't doggos. They are self propelled meat delivery systems. Doggos are nothing like that.", "Baby skin chairs should cost more resources, but provide a comfort bonus due to softness", "It's so bad that a Staggeringly Ugly beggar once wandered onto my tile and I gunned him down for a free mood bonus from rival death.", "My colonists will eat the dead in front of the wounded, then put them all in the main building and set it ablaze", "(forbidden mod) a massive tribal raid came to my settlement and walked right into a psychic droner. as the two forces engaged with each other, two tribespeople decided to bang in the middle of the fight.", "\"What are the benefits of slavery? They try to escape every once in a while and get hurt and can't properly work for days\"", "(NSFW) Are children harder to shoot?", "Will ridding my colony of women turn my men into homosexual?", "\"I had a 2 year old addicted to yayo run wild which I forgot to handle because a massive black insect hive was attacking the colony. I assume he died. We never found the body and his parents are both miserable.\"", "\"I’m already at my pop cap with 19 pawns and this lady is 28, the perfect child bearing age, also I’m using Safe Job World. So what better way to increase my population them by garnered babies. All I need to do is artificial inseminate her and we are up and running.\"", "\"Does anyone else keep faction leaders in their people zoo? \"", "You could put the corpses on shelves to avoid any potential \"saw dead body\" mood debuffs assuming your pawns even care", "He died doing what he loved, wandering around confused due to dementia.", "“You take a right lung out, you put a right lung in, you take a right lung out, and you shake it all about”", "I have never tried to arrest a pawn so fast or felt as much satisfaction executing them. So much so that I executed the friend he came with for good measure even though they hadn't really done anything wrong...", "All that hard work erased because some brother and sister wanted to play hide the salami.", "“Ah, when your billowing archotech foreskin catches a tailwind like the sail on a schooner, it’s majestic to behold.”", "Every good vampire needs his mortal lover to teach him the meaning of humanity and then die at the hands of vampire hunters that also happen to be mole people so he can brood in his castle forever", "Top tip, give them peglegs and then remove them. They can't leave their hospital bed, and as long as they have TV/decent hospital/weed they'll be happy enough.", "How can I save the baby that is starving to death? The f*cking dog ate the baby food I had stored, now I'm in the middle of the winter without any way of feeding it. The last caravan that came in recently didn't sell any vegetarian products. No tamable animals on the map that produce milk or eggs.", "You can keep shocking someone and eventually they should become a trauma savant ... although their head can sometimes catch fire so be sure to put that out....", "The quickest way to get prisoners to put on clothes is to straight up knock them out", "The cannibals: ♪ Just eat it. Just eat it. ♪ Have some more tendon ♪ Have some more spine ♪ It doesn't matter ♪ If it's lavish or fine ♪ Just eat it. Just eat it.", "\"I just set up the nugget rooms for my visiting caravans. That way I at least get paid for the trains.\"", "I was wondering why 3 of my guests were sharing the same toilet cubicle, just to find out they were \"relaxing socially\" inside", "Do you wish research got done? are your people not researching? now introducing! lock the door! simply forbid the door and voilà! you now have researchers working ALL day!!!", "Sometimes I wish RimWorld had kenshi like arm and leg dismemberment. I just wanna see a pawns limb get YEETED across the map from being shot by a uranium slug turret.", "\"If my pawns eat enough human, will they get used to it?\"", "...Why did I make an army of revolver-wielding babies?", "\"I made a bridge out of dead bodies!\"", "Does it really count as kidnapping if it's for the person's own good?", "Just a field of naked floating mangled corpses ...they seem to act like spaced armor. I place them a good distance away from the ship on all sides, and I'm pretty sure they have caught a few rounds here and there. My ship uses a literal human meat shield.", "Why is my child constantly getting obsessed with corpses?", "“I had the same problem, so I modded it so inbreeding isn’t penalized.”", "\"im starting to feel bad about cutting slaves legs off.\"", "i've been wondering if there's a way to stop my vampire from feasting on my baby pawns to death? because i can't keep building more coffins and holding more funerals", "\"I love the way you draw Norbert. I wanna burry my face in his ass cheeks and motorboat them. The others look okay, I guess.\"", "\"It's very profitable. I once butchered a 14 y/o tribal girl for organs, and I feel great\"", "\"Ah I see that the naked dance around the fire to make it \"rain\" worked perfectly. Those are indeed a nice harvest. Look at those organs, fresh and huge. What kind of fertilizer you use? Also, did you use roundup to control pest? Lol\"", "I just get shitfaced and wake up to the most intricately built colony I've ever seen then instantly lose it. Rinse and repeat every time i drink.", "That kind of crime results in torture. Light them on fire and put them out over and over. Don’t bandage their burns, until every body part has a scar. Remove every limb. Install a nuclear stomach and feed them raw meat for 1 years. Put them in a stone cave with an extremely hideous environment.", "Does removing organs from a prisoner lower their nutritional value?", "Is it morally right to harvest organs out of desperate refugees?", "Question: Is branding a baby slave taking it too far?", "“I made a man eat his dead father about two ingame days into my first colony. I wanted to see if he would actually do it. I didn't even butcher him first.”", "\"Don't feel bad about this. When little Sarah throws 1 dead body into the flames she will feel sad, but when she throws 100 dead bodies into the flames she will feel nothing.\"", "\"Can i use my dead people for something fun besides eating and burowing them?\"", "I messed up in the scenario editor in the beginning and I added a condition where all the pawns on the planet get a psychite addiction. Every person exterior to my colony, from any human faction has one. Is there a way to revert or fix this ? Thank you", "One wins colonists of the month by not fucking up that geothermal generator construction and then getting turned into chemfuel due to said failure.", "You need to butcher humans. Assuming you are using a butcher table you will on average get 47 human leather (depending on their size and your butcher efficiency/cooking skill) per person. Meaning you need to skin 6 people.", "Does it count as cannibalism if I turn them into animal feed instead of human food?", "I was forever alone. I even tried to kidnap a lesbian pyromaniac child to be my eventual bride", "I couldn't be bothered to deal with their mental breakdowns, so I confiscated their spines -- but later gave into greed.", "Watching your sister and her catman husband do the deed while you breastfeed their child", "rehabilitation of addicts consists of locking them in a room until they collapse from withdrawal. Pyromaniacs are rehabilitated by locking them in an isolated wooden structure where they can burn themselves alive and not live to regret it.", "200 hours in, I harvested my first organs from a prisoner. I feel like a real Rimworld player now!", "Why shouldn’t I keep everyone addicted to yayo in my colony and keep replacing their kidneys with new ones?", "They can live without a stomach and spine, I’ve harvested everything I could before they die and then took their bed and gave them a sleeping spot, I even took their nose, eyes, ears, arms and legs", "s there a way to have safejobworld installed but have the only feature be that insects/mechanoids can impregnate prisoners", "“best way to efficiently brain damage guinea pigs”", "You can always remove legs to transform your prisoners into static abortion machines.", "I'm sorry, could you tell me how to make my children disabled without harming them? This would be quite useful to me.", "Why are we strapping grenades to babies instead of just throwing the baby and selling the grenades?", "“Is there a mod to make my pawns eat prisoners alive?”", "I cut out all of my slaves tongues. I don't know if there's any benefits.", "Wait, does this mean, if I put a hundred baby dromedaries in the heart of the mountain, they could strip mine a line across the mountain to get out while my colonists profit from the ores being struck?", "killing children have bigger consequences than I thought", "My brother in Randy, we are literally r/rimworld, none of us are getting laid.", "I built the worst torture chamber ever, basically the place where I beat up the prisoners who try to escape. It's the dirtiest place ever, it has blood and vomit all over the floor and never gets cleaned, it's also full of dead bodies.", "Please help! I'm trapped in an inscetuous relationship. Doctor Strange checked millions of timelines and I don't win in any of them. Any attempt to disturb the bugs results in unending swarms of insects crawling into my colonists ears and laying eggs. Sometimes its not their ears.", "Refugee betrays colony, barricades himself in his bedroom and lights his bed on fire", "\"-8 mood penalty for 1k silver is where I'd consider selling my grandma.\"", "I needed to change the babies drug policies because they all quickly became raging alcoholics", "\"I took his duck and butchered it to feed to him after I threw him in jail and made him fight other prisoners for my pleasure till he died\"", "Is it just me or is slavery kinda bad?", "If your religion allows cannibalism it will make life a lot easier and even boost your economy by a fair bit.", "\"I generally like refugees, but recently I had a reward off for killing all of them that I thought was too good to pass up.\"", "I cut their arms of and beat them up every 3 days. They still use their teeth to attack back. So I removed the jaw, but they still use their head to bash.", "I've found isolating people in a cramped cell, set to freezing temperatures, stripping them naked and feeding them nothing but raw food tends to sway them towards the one true path pretty rapidly. Random beatings also work depending on whether they like pain or not.", "How do you guys level the melee skill of children I usually just send them in a chokepoint with their mother behind ready to kill anything too dangerous Discussion", "Install a mod that let's you build horse meat walls. Send the raiders a cleae message as soon as they arrive on your door step. The colonists here are not sane and are not to be trifled with.", "Oni is about survival Rimworld.. not so much.. it's about dying and killing and selling the lungs and left robotic eye of a raider you captured to buy more drugs for your ambrosia addicted dog.", "\"How much cum woulf a thrumbo produce?\"", "Fair point. Other sources recommend to let dogs chew off the head to fix brain damage with res serum, therefore I now tend to believe that you are right.", "\"Wait for a naturally good time to butcher people - a wedding is perfect, for example.\"", "Stop my slaves from eating children and killing each other?", "Vomitting in bed is seductive foreplay", "Perhaps you shouldn't let your husky perform surgery. Everybody knows Alpacas are the true surgeons of the animal kingdom.", "I received a mission that I needed to keep a prisoner alive for one week in my colony, when I realized that I could do anything with him if he didn't die.", "I wonder, if you butcher a bunch of merchants, make dusters out of their [human] leather and gift them back to the faction - is the balance positive or negative?", "... I’m fine with turning my disobedient colonists into living carpets and treating raider camps as necro-marts, but dude...you got issues.", "\"Dude personally I’d fuck a megaspider before i took a kid’s kidney\"", "'You'll need a steady supply of kidneys to replace the ones that'll inevitable get damaged from constant drug use\"", "“Does removing tongue negates the negative effects of abrasive trait?”", "Russia is just RimWorld with a bunch of mods", "\"He also had no weapons or armor.\" Reply :\"That's not completely true, he can act as armor for your own Pawns. A meat shield. He's definitely qualified for it now.\"", "I need this \"a crack that has splintered the peg in two almost a third of the way down the wood. You are now essentially walking on two smaller, sharp wooden spikes that are embedded into your flesh, twisting and turning with every step\" to be included in the Warcrime Extended Mod", "Babies are the best food source for Vampires", "Yup, every morning when the alarm goes off, I check the weather report to see if it will be a good day to hunt homophobes.", "\"Zen achieved by cranial trauma is still zen.\"", "A wise man once said '' Give a man a yorkie, and you feed him for a day. Give him two yorkies, and he will make himself a army of Yorkies, kill 20 tribals and feed himself and the yorkies with their flesh forever ''", "\"Yes it’s called sterlize they, or you could use birth control. If that doesn't work, kill all the women.\"", "Is there a relationship penalty if I sell the organs of prisoners back to their home colony? : RimWorld", "\"how do i kill a visitor without getting blamed\"", "In my latest colony I built a \"movie theatre\" for my pawns, complete with megascreen TV and masterwork human leather armchairs. Who says the rimworld has to be harsh and cruel?", "Me realizing I can safely kill the organ/leg/spine harvested Orc prisoner who is the surrogate birth mother to my first successful Dwarf ovum implantation because her baby is currently in a vat and won't be sad about their (birth) mother's inevitable death.", "That meal was made from their children but they'll never understand that so no harm done.", "I always think to myself \"This time around I'll invest in some of the non-lethal weapons from VE.\" Then some chumbo decides to bum rush the components stack because he stepped in a puddle. Suddenly an LMG, two Pump Shotguns, and a pair of Longswords is non-lethal enough.", "The best war crimes are the ones where you make a fuckton of money.", "If you're trying to get a colonist clean of addictions or of long duration mood debuffs consider cutting off their legs. People without legs will remain in bed and be unable to have mental breaks.", "\"How can I tell my family that the prisoners in my colony aren’t slaves\"", "I'm usually fine with refugees so long as they can cut stone chunks into stone bricks.", "who needs sleep when you're pumping out kids faster than catholic rabbits?", "Too young to work? What kinda shitty mod do you have that doesn’t let you have child slaves?", "Also some of them are only half siblings, because when I artificially impregnate prisoners for profit I use my character as the father, so the babies have good stats", "I was tired of all the kids crying so I put them in the cribs on a room with stone walls and burn them all with a molotov", "Need a quick mood boost? Mutilate a prisoner and execute them.", "\"Obvious choices are to sell her as a slave or cook her, though EPOE does have brain surgery later on if I remember rightly, but she'll be completely useless until you've researched it, I'd sell her and buy a replacement, give the boyfriend booze... All sorted\"", "\"Any mods to allow slaves to share beds with colonists?\"", "Yeah, like with blind cults, let one disciple carve out his eyes by its own. Everybody is attending the ceremony, but its boring, because nobody is watching...", "\"I wish you could assemble bones into a monstrosity to make a bone golem that you can animate... would be fun", "\"Will Baby Prisoners Give Less meat?\"", "\"But the first step is the most important. Ethics and morals only get in the way of success. You can do anything you want after that.\"", "Well hot damn! Tighten those slave collars and warm up the surgical table, it's warcrime-o-clock!", "Can I smoke weed and other drugs while pregnant?", "Why the hell are they getting angry at me for stripping MY slave (that, apparently still belongs to them somehow)? What is this dumb mechanic? I paid money for this guy, he's mine. Period. Is there any way to bypass this except recruiting?", "\"Well, we've learned how to gruesomely profane the sanctity of the human mind by butchering someone like an animal, so that we may feed this abomination of silicon and sentience.\" \"Sure have. Now then, would you fancy a spot of cheese?\" \"Why, I thought you'd never ask.\"", "Is there a mod that allows me to skin prisoners alive?", "Looking for a mass execution mod", "Jeez, I accidentally euthanized my cook", "\"Open the developer tools and bomb them a couple times then revive them and launch them at their enemies to watch them get their shit pushed in over and over again. It’s what any sane person would do.\"", "\"Why my colonists can't eat my dead kids? I do not have food,and they can eat only other dead men but not their kids. Why?\"", "Putting the infant back in infantry", "“You fool... Schrodinger’s cat doesn’t account for cat based slavery”", "I skipped all of that effort and let the baby die, I had a spare resurrector serum.", "He means you cut the kids dicks off after they are born and raise them as super soldiers.", "“Legs are replaceable, glory is eternal”", "Now I can fulfill my dream of feeding my prisoners deep fried cheese and only offer them one wooden latrine in the middle of their prison. Cheers!", "Remove the legs and you got a good breeding mount.", "the horses keep \"rescuing\" the survivers, draging them back to the burning barn", "\"Thank goodness for the mod, rimworld was certainly lacking in the warcrimes sector\"", "\"I feel the same joy everytime i see a nudist cannibal. rarely do i feel so well represented.\"", "I stick mine on life support, blow their brains out, and use them as a spigot for blood, which I use in place of medicine for autopsies. Harvesting organs while their alive is such a pain, it’s much easier when the flesh scan is steaming and thrashing.", "Is there a way to encourage prisoners to eat more piecemeal? Eating a whole limb/head/torso means they waste most of the nutrition, but we are not cannibals so we don't butcher people.", "Why can't I bake my prisoners? :(", "\"Is it possible to kill a pregnant person without killing their baby?\"", "Wait, so you're saying I can keep a quadriplegic around as a tax deduction?", "Also ignore the poor burning baby elephant in the corner :(", "\"I took one lung and one kidney and used them to replace damaged/ missing ones . I was holding into him alive so I could get any of the other four organs he had left depending on what I needed\"", "Tip: Drug your prisoners/slaves so that they will fight to the death", "\"I've had issues with insectoids a fair bit recently due to a mod, so I decided to combat the problem with another problem, make a steam geyser, and surround the colony with triple thick bonecrete walls, and then just cook em alive, bit too harsh? I don't think so, could be napalm instead.\"", "worst case: shoot him. maybe you'll hit his stomach and destroy it, most likely not but a better option than certain death still", "as far as I can tell only creatures that are tamed as animals can be milked, meaning I would have to create a way to get human prisoners to become considered as animals which is frankly beyond my skills", "Anyone else here ritualistically consume the corpses of dead colonists?", "How many blood slaves do I need for my catgirl tribe?", "37k!", "Ever stuffed lettuce into your face? Like, gone ham on some lettuce? It feels great after a session of lawful organ translocation. So yeah, that's what the eating animation is about, stuffing your face with lettuce hopping to drawn your inner demons in veggies.", "I didn't want to mention anything, but.... Your last sacrifice was lacking, man. You need to fatten them first. They are not very useful if they don't have enough leather to make a proper cowboy hat :(", "Colonists will be happy eating rice off the cum-drenched floor as long as there’s a legless raider with both sets of bionic genitals in the next room.", "Is there a mod allowing you to rip the face off a prisoner and wear it?", "Can I make my Wargs vegan by transplanting brains?", "It isn't human it's \"synthetic\" meat. - McDonald's manager", "FUN FACT: In an effort to make the baby happy I discovered that babies and heroin don't mix well.", "This child is floordrawing next to a bunch of children corpses", "/r/shitrimworldsays hit 20k subscribers yesterday", "She has no legs and therefore no rights", "If you use Prison Labor you can make your prisoners butcher human corpses and have them carry the guilt", "“How many warcrimes has your youngest committed this week?! Mines at 10!”", "What is the proper amount of torture for prisoners to let them still be useful for Prison Labor? How many eyes and hands etc should they keep", "For now, I’ll pray that the hive keeps the warboys in check, otherwise I’m going to have to lock up my amputated pregnancy pals to keep the birth rate down.", "“Got to feed the parents to the kids, it’s tradition.”", "I feel like the more civilized a colony gets, the more war crimes they must commit to become more civilized.", "Spare the child. Harvest everyone elses eyes and nose.", "You set up baby factory not for meat, but for organs. Meat is byproduct.", "\"I Just LOVE the way my clothes Smile while they keep me from burning to death like the guy they are made from.\"", "Mountains are like lindor chocolates or human skulls. The stuff on the outside is okay, but you have to crack them open in order to scoop out all the delicious gooey insides.", "I had two legless high immortals and had a fairly lucrative heart farm.", "\"It adds an interesting challenge. But the gestation and growth periods of humans are too long so they will always be overshadowed by other food source animals\"", "'How many organs can I remove before my prisoner dies?'", "\"For the next person Im gonna take their organs and limbs so they cant even struggle while being boiled alive\"", "does incest have any negative effects?", "Is it possible to make future raids easier by cutting off tongues, legs etc. when you imprison and release them?", "Someone doesn’t understand slavery and that makes me happy.", "\"How to stopping my slaves from falling into a love?\"", "\"Do you like your guests coming into your pawns bedroom at night, waking them up (disturbed sleep) just so they can have a crafty wank in the corner\"", "Making a pawn roll play as big daddy to the point of chopping off her arms and then replacing them with drills is the sort of needless cruelty I can get behind", "Ugh, you only had to eat the corpse of your late wife. Get over it and go sand cave walls in darkness for 7 hours", "*shits myself* Maybe God isnt real.", "\"I'm not entirely sure being a cow is worse than being a limbless torso.\"", "\"Fuck yeah dude, she's basically a guard dog you can bang. So a regular guard dog, if you're from Florida.\"", "I got so mad I deleted the save and hopefully this monster with it, but I’m terrified he will one day reappear to exact revenge for being deleted. I’m so paranoid about it that if all my colonists are downed I just delete the save lol", "Child neglect is ideal for babies!", "The new gas chambers are incredible! Can stop pawns before even fighting!!", "I try to start off good, I really do! But then Auschwitz ensues…", "There was a group of 10 refugees begging me for a place to stay. I enjoy playing as a \"good guy\", so they were welcomed with open arms ... That's alright; her time in my colony had taught her valuable doctoring skills. Skill she used to remove her husband's organs. And then those of his friends.", "Deathless babies do not make better mortars", "You seem to have a lot of other babies, why not just let the monster dog keep this one?", "Excuse me, someone left their baby in the blender.", "Can you milk the breast milk via the new milking robot?", "Sadly I can't harvest her anus. I tried.", "Headshots, blown off pinky fingers and all of my expensive shit exploding. Makes my dick hard until they break my fucking flatscreen.", "One time I had a pawn who would always puke right before eating her meal, this meant she was in an endless cycle of puking trying to eat her meal only to puke again she was literally starving the entire day and couldn’t move a single tile without puking", "The oviraptors gathered in a big pile and started all fucking each other. One even started raping my yaks. They’ve eaten all the vegetation, so there’s only cum stains left.", "“Don’t worry, they also get their funding from prisoners who ‘mysteriously’ became organless popsicle people”", "I now see why base Rimworld will never have children.", "“Human leather sucks compared to most leathers anyway, and human meat is pointless to eat when you can otherwise hunt, forage or just farm”", "Is it okay to farm humans for meat?", "\"Where'd that chick go? I need to make sure she's really dead so that I can cut her up.\"", "should I free them or let them have baby first then execute the father and sell the mother then adopt their child?", "If I saw someone wearing a top hat made out of dog sheddings I would just walk away", "\"Seeing as Dolly here is a teenager is it possible I can force her into eating human meat to the point where she develops the cannibal trait?\"", "A bear killed all of my colonists because the door was left open by a bunch of rice", "\"...but his organs can lead to the success of a colony\"", "\"The baby farm can always make more infants\"", "Hey, maybe you only sacrifice female pawns on the day of their menstruation. Could be a fun roleplay lol", "Send a colonist to beat up or open fire on the baby until it is unconscious and/or unable to move and you should be able to feed him afterwards since it will be unable to move and get out of his crib.", "I like to take the humanitarian approach with my prisoners. Normally I'll harvest as many organs and parts as I can without actually killing them, generally leaving them a limbless semi-vegetable.", "I like him. I can butcher and eat humans and he forgets about it pretty quickly.", "\"Your cats eat your infants?\"", "What the hell? This is the second time not so random randy has given me 7 golden eyes.", "\"Will Rats breed fast enough to thrive off of eating their own dead?\"", "Why aren't my coolers heating my base?", "\"However was frustrated when i had prisoners i wanted to keep and prisoners i wanted to cook alive all in the same a/c system.\"", "So by growing tomatoes, you can literally send your son's ship to space via ketchup.", "You could create a puppy mill, but each puppy only yields 2 leather so not very efficient.", "Help! My prisoners have fallen in love. What do I do? - Put a cooler in there and watch them freeze as they try to cuddle for warmth.", "Pretty sure vents are flameable. They are made of steel after all.", "Social fights are just surprise melee training", "Has anyone made a rat chamber that eats raiders alive?", "Everyone is just going to have to take turns sleeping inside the crematorium", "\"so I just bombard herd animals from a distance with high explosives.\"", "Has anyone had to sell their own kidney to buy food?", "Recently, I've been getting crack babies born with brain damage, addictions, and other problems. It seems to only happen to the chemical fascinated/interest mothers who binge during pregnancy.", "Have you tried slaughtering a faction's caravan and then making peace with them by FedExing them the mutilated corpses?", "I used to do that but I'd remove the arms and replace the legs with peglegs. It's always funny seeing that appear again in a raid. These days I've got genocide and torture automated to the point I make a Nazis look like they're choirboys.", "Welcome to the Rim. Would you like human leather cowboy hats or nugget sex slaves?", "This sub has no mods anymore", "One joint turned my colonist into an asthmatic duck", "I’ll believe compacted steel and machinery, but mining for thrumbos is where I draw the line.", "Exceptional work may yield a night's embrace of mother cocaine.", "Burying prisoners alive would be so very satisfying. It'd be even better if we could see how close to death they are, then dig them up, nurse them back to life, then bury them alive again.", "I don't think there's an option for that since he's a volunteer for my bloodfeed/organ harvesting farm. On the bright side, he's 50% cured of his asthma.", "I'm personally a big slave fan.", "but instead of releasing them, release them surrounded by your melee fighters. Beat them senseless as they run and just recapture them. Rinse and repeat until you accidentally remove too many organs in melee combat.", "Words cannot describe how fucking sad I am, fuck this game and fuck those cursed beavers.", "War crimes are like Pringles, once you pop you can't stop!", "Are drugs worth it?", "Goes to bed with his wife. The next morning she wakes up to find a 300kg megaspider under the covers with her...", "Honestly I would take her, kill her, and turn her into a lavish meal for 8.", "I've honestly gotten bored of RJW. Nice stuff, but it got boring fast and I was tired of my cook having cows.", "\"If a prisoner dies in prison and you don’t get rid of the body but instead starve your other prisoners, will they eventually start eating the dead body?\"", "Thank God I'm not the only one with a dark wet dungeon full of rotting corpses next to my preschool!", "\"merely slaves, all citizens are expendable for the greater cause\" \"we are not responsible for radioactive metal chunks that may be ejected\"", "\"I am trying to cure the pregnancy because I can't amputate the radius\" - Answer: \"Just make a punching circle (have a few colonists beat up your pregnant person). The person will miscarry due to bad health. Problem solved\"", "I don't want to wait a whole year for my colonist to give birth I want my hybrid human asap", "I think my doctor is purposely Castrating all my males", "i like to remove the legs of any prisoners and put them anywhere i can, sex change any guys so my colonists can take out all there pent-up issues whenever they need and if any prisoners have kids ill check if they are worth keeping if not ill kill them at the feet of the mother and butcher them", "\"I had the same problem but it was when I gave a flake to a newborn.\"", "I want Gnugfur the pizza loving twink to cave my skull in.", "He is having a scar on his penis. I could try replacing with a wooden penis if that would help.", "Have you noticed an increased need for lungs since Biotech?", "\"And kibble, don't waste man.\" One of the things I love about this game. Most games there's an implied comma between waste and man.. this one? Heck nope!", "this is actually the most wholesome Rimworld torture I've seen", "Good question though", "Why do my Gay Pawns Bang so much?", "Can refugees be more fucking grateful?", "“The turret keeps them honest.”", "They have fuzzy skin, like a baby's. A hydrogen filled baby", "“I draw the line at fucking a megaspider”", "\"My first success with the holocaust oven\"", "How to castrate and cook my prisoner's balls?", "\"...If you would have a chair made from his legs, engraved with his capture, that would be close to rimworlds purest essence.\"", "\"The only psychologically unstable colonists I ever choose to recruit are now hats\"", "Artificially impregnated prisoners will not feed their baby", "You Can Use Autobongs In Your Defenses To Remotely Drug Raiders", "I just yoink genitals from animals instead.", "“You are very welcome, have fun with it. Send some screenshots when your first human harvest is ready!”", "Did you really just calculated silver worth of harvested organs from 10 people? Or you have that memorized?", "I love all animals, bison, megasloths, elephants. Especially thrumbos! They give lots of meat for our lavish meals!", "How do I induce a misscarige [sic]?", "wait i am thinking now, war crime stop you from mistreating captured enemies, so if you harvest their organs b4 they surrender or run then it's fair game right?", "Gonna be absolute chaos. Groups with Doomsday launchers blowing up bases, harvesting organs, and disappearing into the night, leaving legless, armless, organless husks laying on the ground.", "Is it safe to have my slave watch my newborn", "Why aren't my cats taking drugs??", "Kid named Lips asked me for 2 beers", "Can I Abort a Child By Beating the Mom Up?", "The faces on my clothes aren't smiling, but they make me happy", "In theory could occasional sacrifices be beneficial?", "I don’t even know what to say", "\"But he was a cannibal so that helped get rid of the corpses\"", "\"You know, the last time I ate without a table I went on a mental break and tried to destroy a mortar shell in a room filled with chem fuel.\"", "Imagine this fate worse than death, being confined for eternity just to have your organs harvested again and again. Feeling especially war-crimey today.", "\"Do prisoners need their legs to be released?\"", "Issue feeding corpses/human meat to prisoners", "\"Pemmican is full of nuts\" \"I would love to taste your nuts\"", "I'm told this subreddit may appreciate this as well", "Imagine getting a dick ripped off just to attach it again", "Anyone else think slavery is bad ?", "You just walk up to someone and start talking about elephant penises, huh Paine?", "Laser Steam Drill + Nursery = Crispy Toddler Nuggets", "That's it she is going into the fucking fire chamber", "I still think pregnant beings should yield more meat, since they're bigger through carrying young.", "The \"Your organs are gone and this is where you are going to die\" room.", "danger solo with his chain shotgun. No injuries to him. It was a literal suicide run on purpose as I was testing the viability of a 3 year old army of child raiders run._", "Is there a safe way to gouge captured enemies eyes without surgery?", "\"If you can get them to STOP going on mental breaks, you might be able to turn them into a psychic meat beacon.\"", "Is she useless without a male for breeding?", "\"Prison labor mod is awesome!\"", "\"My leader took her chain shotgun and blew his dick off. Pelvis: shattered. The financee survived and got a new man. My leader carved a sarcophacus of killing him and put his now decapitated corpse in it (i let the rats eat it) in the throne room.\"", "How to force someone to falling in love? : RimWorld", "\"or them dying from accidentally missing heart or liver\"", "If there were reproduction in RimWorld, theoretically imprison some raiders, force them into a relationship, and then live off their children. By eating them.", "\"My jellyfish pawn gave birth to a jellyfish child which have smokeleaf joint addiction from the begging. wtf?\"", "Their screams will sound alarm to any passer by that this is what happens to those who dare raise your ire", "I found out that bear traps are an effective means of prisoner aquisition...", "Babies probably weren't put in the game because they would just die. There would be a mountain of dead babies in every colony.", "Can’t have a hedonistic cult of bacchus without some group fuckery. Please don’t quote me.", "my leader got usurped by a younger psychic because she learned chronomancy and went into a 5 year psychic meditation in 6 hours and levelled up twice. but she sucks at social so she lost the trial", "[Is it possible to] farm trauma savants?", "So im starting to think buying eggs was a bad idea and need help killing 165 cobras", "I love transhumanists. Body building just hits different on the rim you know", "'That debuff is from BEING MILKED'", "I kill the girls off, since a single boy could impregnate all the girls.", "Organ harvesting is very worth it actually! I keep all organs in a freezer and any time my colonists catch lung cancer from all the smoke leaf I jam into them I just replace their lungs.", "When people are depressed, do you just beat them to cure it?", "\"I have a set of amputated, pregnant, blind, deff and on life support prisoners on my organ farm. i took 4 and gave them muffalo mamaries, and ovipositors.\"", "Look at the breasts, I am going to make so many hats from the amount of flesh there!", "'What age can the kids safely handle the charge rifle?'", "MY VERY FIRST RUN: i have had a none cannibal.. eat a freshly died pawn because he wouldnt help her.. and there were cooked meals right next to them.. - the last person trying to save the freshly died one got attacked by a bear..", "The flesh of an infant is best, much more tender and delicious", "Slap a shield belt on those tikes and tell 'em to get on out there and start dodgin!", "One death is a tragedy, one million deaths is a profit.", "I pay for everything in corn and body parts.", "Thanks, now I'm thinking about skinning someone alive and keep them alive while I make a jacket and a hat just for them.", "I took over a neighboring hostile camp and enslaved them (with mods). When they weren't happy with their 3 sleeping hours I would harvest them for their brains and livers. The scandal did not last long.", "Doctors have no trouble trampling the damaged and dying", "Reverse the order of my sentence lol, I meant killing the single animal was much worse than the torture and murder of thousands.", "\"…did the only thing a sane person in my situation could do: I had her murder him in bed with an LMG, and kept his body in the corner. \"", "Does cutting off a pawns ears counter the disturbed sleep debuff?", "However, what if you made potato slaves?", "The never ending tides of manhunting Geese, and one man's struggle against the wrath of Randy.", "\"Prisoners and artificially impregnating them\"", "Not the first time I've had chicks blacked out in my shed.", "\"So far my wife and son have gotten the plague and my Yorkie got eaten by a fox\"", "I've seen this sub post some horrible shit. War Crimes, Canabilism, Orbital Bombings, but you...you need to go see a actual doctor.", "You can't use that word anymore, grandma! No, not even 'just in bed'!", "..Warcrime?.. Well if he’s not alive to tell the tale, then technically it’s not, or just execute him later", "I love how quickly the community weaponize new features.", "Are pants worth wearing?", "The Meat grinder from VFME calls for the blood of guinea pigs.", "\"I am NOT going to kill this pregnant woman!\"", "When you sarcastically point out that you're not made of silver", "I didn't think of mutilating my prisoners before killing them. Thanks for the reminder though.", "Do animals in the late stages of pregnancy yield more meat when butchered? • r/RimWorld", "I really wish inbreeding would pass on genetic defects. I'd love a pack of hideously mutated wolves.", "I let my animals graze around all the map to avoid malnutrition. My labradors are starving anyway. After a while I confined them in the hay stockpile but they didn't eat it. The only things they seems to eat are animals bodies.", "I don’t know if this is odd or not but I don’t commit any war crimes. Every raider I kill gets their own grave. I do not turn them into hats. I don’t have a human refinery designed to quickly and efficiently turn human corpses into chemfuel. I do not have a freezer inside my fortress that is designe", "I turn my freezer into a prison, let him freeze to death, and then he's already in the freezer, so I don't have to go skin and cut him up right away.", "My doctor won't stop smoking pot during surgeries", "\"Sometime I worry about how many pawns I acquire, then I just remember to abuse the worthless ones.\"", "How many war crimes can one commit before the kids wake up?", "I walk over to the legless man, and I smile. You don’t need your legs to dig, and he’ll do perfectly in the quarry.", "The next time they get into a social fight, make the winner eat the loser. Eventually the problem will solve itself.", "You know what? Harvesting bodyparts, sure. Making hats out of people, definitely. You want help installing a rape mod? I think you can probably fuck off.", "Children and shooting ranges don't mix well", "Praise the atom and pass the boom baby", "\"It would be a redneck ICBM.\"", "I kinda refrain from keeping kids in the front lines. Unless they're kinda shit. Then it's living target to district enemies or becoming a hat.", "\"I have no table in my colony\" therefore no life ; \"I have no light in my colony\" therefore no hope", "\"Oh, artificial. I thought we were talking actual rape.\"", "Excuse me sir, Do you prefer your children enslaved or free?", "A vivisection only causes a -150 mood penalty ! Oo the possibilities", "Making a Guantanamo bay so your colonists don't get sad because you torture people.", "So now the nude hippie gargantuan tree tender is going to be the surrogate mom of two random addicts who are going to get beat to death or die from lack of drugs and I can't be more excited.", "Reminds me of the time I had the dinosaur mod and the zombie mod installed and lost my colony to a single zombie t Rex who was virtually unkillable, taking about 200 bullets like it was nothing", "Luciferum is the Perfect Late-Game Drug for Slaves", "Is there a way to mass kill pets? A lot of them escaped the pen and is preventing me from building (eg the solar panels)", "I've spent a week slaughtering ducks. Help.", "I didn’t see the title or sub and was really confused", "“You should also single pillar-roof that bad boy so they get crushed as well.”", "Don’t mind the dead body in the fridge. It will come to use later. Also average temp is around -26C. Half of my guests freeze to death in their rooms upon arrival", "\"Gotta maintain that ethnic separation and supremacy!\"", "any way to make colonists emotionless?", "I don't see how a helping hand needs all of his/hers organs?", "I used to care about things. But then I discovered the amazing profitability of organ harvesting...you would be amazed at the amount of human rights violations I can stuff into a single box without feeling a thing.", "I don't know, it's my first time playing with children, but my guess would be 12ish?", "how to build a penis removal room", "Apart from the one prisoner I test out all of the weird torturous weapons I find in the mod directory. Am I a bad person?", "Does locking my prisoners in the same room as about 100 cats and an ocean of beer count as cruel and unusual punishment?", "The dogs are drunk again and one of my guards bit the eye of a prisoner who had no arms.", "Can I harvest skin from alive pawns but not kill them entirely, and if I could treat them for more skin later that would be awesome. They could even get a mood debuff for being skinned alive, feel constant pain and also chain them to the walls. Killing people for skin is not moral in my opinion.", "“I NEED MORE CORPSES”", "“Why cant we use corpses as target practice?”", "Thats at least pretty good for rest and surgery success right? You can make it your best organ harvesting bed", "Factories will be rated on human leather hats per minute now instead of spm", "Can you make a sustainable fur farm out of the furries?", "Now that they won't randomly decide to ride the Flake Train to the afterlife", "Turned my slave into a head just emanating good vibes, thought you guys might like it.", "“Chemfuel.”", "I tend to make the wanderer volunteer to fist fight a bear or something to prove their worth. So far they've all been found wanting.", "How can I propagate my superior genes without inbreeding?", "Use him to boost a medical by replacing all his body parts with wood. Queue them up at the same time to prevent him from leaving. Or remove his legs first", "Recycle it and make a new coat, slowly adding bits of your new raiders as you go.", "Ah yes another fine place to feast on corpses.", "Is there a mod that lets me build a gas chamber??", "She had dementia and bad back and every day she would smoke some leaf and knock herself out so I euthanized her and a dog ate her head.", "Can I burn toxic waste packs to dispose of them?", "I might as well have started a deforestation business that doubled up as an incest freak show. Try it some time", "If I removes of the penises from my slave, if I skin them are the leathers worth less?", "Holy fucking shit I have never considered this. I'm giving all pyro's peg legs and releasing them addicted to drugs instead of just beating them to death.", "I once removed both arms and legs from a prisoner, as well as one lung and a liver. Then I sold her to a slave ship I saw that same prisoner on sale in a nearby faction, pretty cool😂", "If humans are so smart why are they my dinner?", "I'm surprised we didn't force an iguana to OD on coke earlier if I'm honest", "\"Set up an open air graveyard outside your killbox and let the bodies fester and decay just out of sight of your colonists, raiders think twice when they're charging through waist deep piles of bone and fetid flesh. Bonus points for causing a mental break mid raid.\"", "Animals drinking my alcohol is the reason i dont brew anymore. Huskies cant light joints or smoke flake.", "Are fat people easier to shoot?", "Have they not worked out that Miniguns are far more optimal weapons for toddlers?", "My cat is addicted to meth please help", "It's better without context.", "\"Do you just brick prisoners into a hole in the mountain and leave them there to eat their mates as they starve to death in the darkness?\" \"Usually they tend to make an organ donation first.\"", "That’s a good point. I’m sick of newborn puppies lying unconscious because they drank all our beer.", "Facial stuff mod... \"Does it let you organ harvest their face?\"", "\"you want to be drunk during entire surgery\"", "Seems like you could make legless prisoners run the sewing machines and feed them the ones who can't craft to keep costs down.", "I kept a brain damaged old woman around just because she could clean. No regerts.", "Yeah I was harvesting my daughter's lungs to cure my cook's asthma so he would get off his ass and butcher all the damn beavers in my cooler when I had the same thought.", "they won't bury the dead[...] I have a fridge full of dead bodies", "Hotel run by cannibals. mod suggestions and why?", "I had a fun five day journey just to buy a slave to build a fucking shack to live in", "I used a mod called Extended surgery, it allows you to harvest and install eyes, install artificial noses, ears ect. so mutilated pawns can be fixed, but I used it to remove their ears, noses and one eye so I could torture them", "I don't know which is worse so I post both", "One of the tribesmen whom I've previously captured and harvested organs from decided to join my colony and now he's harvesting organs from his own people. • r/RimWorld", "Do teenagers have sex? \" I'm uncertain, but my 15 year old kid doesnt seem like he's getting it on with his 27 year old girlfriend. He's not gay either.\"", "Lovely but I was really hoping for an uwu", "My prison isn't quite disgusting enough, and puddles of liquefied bodies are a good reminder to the prisoners that they shouldn't waste their food", "You my good sir are a completely insane textbook psycho. Needless to say you’re a inspiration to us all and a model colony overseer keep it up.", "Question. Does multiple perpetrations of organ harvesting count as one war crime or multiple?", "If you skin pretty people will the clothes made with them be pretty?", "Do they get the dodge bonus from having a smaller body size? If so they would make excellent child soldiers.", "I can put colonists or prisoners in it for power, and once they're in I have the option to dissolve them for chemfuel", "I usually just throw the bodys directly into the pig pen. They can feed directly from the corpses", "“Shouldn’t invest be the norm?”", "I don’t know what my friends’ skulls look like", "Now the real question is how do I give a baby an appropriate amount of heroin", "I always start good, but then that sweet taste of gold from organ harvesting takes over.", "How do I get rid of my (apparently explosive) boomalopes???", "Really want to make a drug farm worked by child slaves.", "Humans sure be tasting like chicken.", "\"On the bright side, if you're lucky there will be enough corpse left for a hat\"", "How can I pollute as much as possible?", "Mate I’ve started organ harvesting rings and mutilated prisoners of war. I’ve breed animals in the thousands to be used as attack animals, ripping pirates to shreds. I line my defensive walls with rotting corpses to break the will of attackers. I’ve used animals as suicide bombers.", "If an animal miscarries, we should get some meat and leather from the fetus.", "\"How do you guys kill your pets?\"", "I have actually been killing his family, red wedding style, left right and centre, for around 5 in game years. On the plus side, he's provided me with lots of great medical training", "In Lost Tribe mode, you can sell your other clan members on the first day, and buy cool stuff instead.", "Pfft. Prosthophobe. I like a babe who can bring some hydraulics to the bedroom. Except the jaw. Please not the steel hydraulic jaw.", "it is kinda like the sims.... only with 100 times more death, cannabialism, beating animals, and people to death and harvesting their skin and flesh, plus remorsefulless addiction, sadness, madness, and getting killed by a grizzly bear.", "\"I hope my colonist make art of that\"", "An Argument for Giving Teens Yayo", "Is it ok to drain blood from pregnant women?", "Is the Weight of a Prisoner reduced when i cut of their Limbs ?", "Does Anyone Else Imprison People to Convert Them Faster Than Using Moral Leaders?", "i like to capture a few raiders and put them all in one cell. Than kill them all leaving only one. and make everything out of their flesh for the final victim as a constant reminder.", "Seems like kids should just occupy a pet slot or something", "You don't turn a 5 yr old into hats? Their skin is very tender so +5 comfortablity", "Hauler Bears? Bears that haul.", "Animals eat human kibble, humans eat animals. It's like human meat laundering for those picky non-cannibals, duh", "If you have a full prison, all in one room, just deny them food. They will break, beat eachother up, and then eat the ones that died.", "\"Breast milk is free and about the same labor as loading a tank.\"", "I want naked blindfolded people", "How Much Space Cocaine Does It Take To Kill An Elephant?", "I love it when you decide not to bury corpses but instead throw them in a stockpile, and then at the height of winter as your food stores run dry Randy gives you a cold snap. It's like he knows that the only way you're getting out of this is by going donner party on your corpse stockpile.", "WTF is up with only being able to harvest one organ before the captive dies? That's hardly fair.", "Gentle description of our walking meat sacks... I mean guests", "Once the two of you have married you should look into organ harvesting. The honeymoon phase is the best time to exploit that.", "Any fix for my grandpa with dementia or should I just scrap him for parts and turn him into a coat? : RimWorld", "\"Sir, why is the prison carpeted in red? Aren't red carpets reserved for dignitaries?\" \"Well it was green when we first built that wing. It's now natural red, I think you get the idea.\"", "Turned my slave into a head just emanating good vibes", "How the fuck do you screw up ear surgery so badly you cut of your toes?", "If he won't wear clothing, then he becomes clothing.", "A tutorial on making human leather hats", "They can keep them. I only really like baby hands", "Seed me Daddy uwu", "My colonist married our lobotomized slave", "How do you treat Enemy's corpse?", "Hewwo dis ish teh FBI, the Furry Bulge Inspection agency, coming to awwest you for hydwauwic anyuses Put your paws and pants down and bend ovw", "​ The moral of this story: If you work your pawns to exhaustion, they'll have a hard time giving up and leaving since they'll be so tired.", "Why i'm getting the debuff for butchering people when i'm only using them to make chemfuel?", "You could always remove her legs, then reinstall them when you need her.", "Oh boy, my cat girl highmate sexual slave farm is about to make me rich", "Thanks, now I can commit senseless violence and war crimes without having to see a penis", "My first though on this game was that $30 was too much but after all those stories i realize this game is priceless", "Really there should be torture tbh.", "\"Best way to get rid of loved ones?\"", "Why doesn't beating up my slaves increase their suppression", "I managed to get 12 prisoners from a raid...When inevitably one of them had a break and started beating on things. I ended up popping in one of my pawns,fired an incendiary into the room and took care of all 12 potential problems...Wood floors, granite walls,and using the prison for chemfuel storage", "How can I keep my pets out of my cocaine?", "How do I get my dog to stop drinking all the beer", "I wanted him to have some god-damned principles and let himself burn to death.", "I only recently realized how fucked it is having a mass grave outside the house", "I figured that seriously, if you skinned someone you could for sure get more than just a cowboy hat off them. At least a t-shirt's worth, I'd think.", "You can create a maze full of corpses and it has a similar effect.", "\"According to my colonist, wearing a dead raider's armor 'creeps her out', but she'll happily wear his skin...\" Comment: \"I would feel the same way.\"", "I've only ever had one antigrain warhead, and I used it on an elk migration. I have lingering resentment to those bastards.", "The third little piggy built his house out of slate blocks harvesting his inferior brethren for organs and hats.", "\"Sounds like a typical Christian thing, it's ok to abduct children from tribals and raise in your own religion, but it's immoral to masturbate\"", "If you collect enough you can make a hat that’s nothing but cat buttholes", "\"I basically have a colony of psychopatic lesbians feeding raiders into a machine to replicate themselves.\" ........ \"I have not researched the maid dresses yet ... I still have some dignity left somewhere.\"", "“I do wish the game would stop throwing random 14 year olds at me”", "\"Child soldiers are the best soldiers.\"", "How do I force my slaves to wear something so they don’t expose themselves to Megaspiders?", "I’d be scared too if a dude with empty sockets for eyes was shooting at me with a sniper rifle.", "I'm really curious how he's gonna reach that marriage spot, because if he leaves the prison I'll beat the shit out of him.", "\"Turns out the best way to get someone to join my free love leaf smoking tree worshipping commune is torture. Who'd guess.\"", "Can refugees be more fucking grateful?", "Love story on a rimworld", "Can I grind medicine by repeatedly beating animals to near death and then rescuing them?", "Baby explodes and the mother can only watch", "A room full of cyborgs masturbating while staring at each other after a battle. Just another day on the rim.", "Slave attempted to run away, how do i mercy kill him?", "My 5 day old kitten is blackout drunk.", "I never thought I'd be justifying the kidnapping of children to myself, but here I am.", "\"I may very well be killing child soldiers or watching them getting ripped to shreds in the future. Can't wait!\"", "i was raided by 6 mechanoids (2 centipedes) and all i had was 2 mini-turrets. i placed 6 other mini-turret blueprints in the night so my contructer can make them in the morning . \"where was he?\" you ask? jerking off", "How to properly use cow/chickenmorphs", "Why can't we eat humans when they're still alive?", "i think i'll start me a new colony if it stops my dogs from eating all the cocaine", "My colonists are usually 100% happy even if one of their kids die.", "A common tactic is to lock people in withdrawal into a sealed room with some food or a paste dispenser.", "Does anyone know the average price of prisoners with no legs? • r/RimWorld", "\"She is currently going apeshit. I'll make her husband to beat her unconscious with a giant mace.\"", "Why can't we make baby food from meat?", "It is generally more useful early game where you need more colonists, organs, or food", "Only happened this once. They all ate each other and things went back to normal.", "He's an alcoholic and the dogs keep drinking all of his booze", "the fact that after a large raid I could fill a supply room with bionic penises was fucking hilarious.", "Because at the end of the day, drugging a pig with luciferium > all of human technological innovation.", "The floor is paved in the organs of its patients", "I mean there are plenty of free lungs growing on prisoners so it is not that big of a deal really.", "Refugee pawn came to my colony pregnant, had a kid and left", "That's the first time I haven't eaten my pet after he died ;(", "How do I sell prisoners?", "It is very easy to keep a misogynist happy when there are women dying all around", "Has science gone too far?", "It’s only a matter of time until you start breeding huskies by the hundreds only to slaughter them for coats in the winter time... • r/RimWorld", "Over here is where we serve continental breakfast. And over here is the gift shop. And over here are the spineless prostitutes..", "I got two colonists from cyrosleep capsules, one with a bionic hand, one with a bionic jaw. Neither have super great skills. Could I cut off my best social colonists jaw, put in the bionic jaw, then give the first guy my social guys jaw?", "Is being gay a bad trait?", "Will people get upset if I start feeding them human flesh? The guy who's butchering them just needs to keep his mouth shut, right?", "I generally stick to my morals when I play [...] that was before I realised that 99% of slaves are barely even good enough to be hat material. There is a reason these people are slaves. They are the absolute worst bottom of the barrel crap.", "Can I start a cannibal community in this game? - Yes you can. - Then I'll have to check the price.", "I did lock 6 other surviving rats in a small room and saw how long it would take for them to resort to cannibalism, but yeah. I have a soft spot for asthmatic animals", "She cured her own addiction somehow. Of course she got back into old habits and is currently laying in a hospital bed sweating it out while I wait to give her her old legs back.", "Anyway to get my pets to eat prisoners while they are still alive?", "“Bro we are talking about enslaving, organ harvesting, trading, eating and bombing children alive”", "\"..he was a slave so I only bought him as a meme..\"", "Children are suicidal", "“How do i make slaves?”", "How many infants can a lactating slave feed?", "I want racism", "Has anyone made a mod which allows you to make soap from the crematorium? - But what will be purpose of it? - i dont know, i just want to make soap from dead corpses.", "One Rimworlder on how to farm human leather", "\"Burn wounds take ages to heal on their own and are very painful. Trust me, my prisoners know.\"", "Does becoming a cowboy hat count as a funeral?", "Is it possible to kill a man with beer? ; just wait until his liver fails ; I usually just give them a wooden jaw", "Capture a man, cut off both legs and replace with a pogo stick, get high and shoot him with crappy bows? This should also give a ton of joy, as it sounds like a good time.", "\"Because at some point even a slave must go beyond his meager position as enthralled labor, and become elevated to that coveted position of livestock.\"", "Turns out we didn't *need* to brutally murder prisoners to deal with our colonists' chronic alcohol problems.", "Last time I got a beggars quest one of them got hunted by a predator which failed the quest. Not that I cared, just found it mildly interesting.", "It's worth it to have a cannibal or psychopath as your cook, as butchering people won't shake them as bad.", "I only just found out than prisoners can be used as pack animals.", "So many kidney dispensers right there", "Can a son marry his mother if his father is dead ? • r/RimWorld", "Why won’t pawn synthesize drugs?", "If I'm feeding my animals human meat, is it better to butcher the corpses, leave them as they are, or does it not matter?", "\"Eventually, my thoughts turned to how valuable organs are.\"", "My dog didnt want to eat, so I had to lock it in the freezer until it did eat.", "Unlike a politician, I don't have any use for a bunch of toddlers running around my colony, I already have one and he's both a handful and an amazing shot with a revolver, that's enough for me. So I do with them what I do with all prisoners; Organ harvesting.", "My doctor is eating the birthed children", "He is pretty loyal now that I have executed his sister and used her skull to build a sculpture in his room.", "Green kerbal hats will be the rage!", "Directing pets to eat dead humans?", "How do i commit mass genocide?", "\"Wish you can add more than 2 arms/legs Turn prisoners into human centipedes.\"", "\"A wanderer who joined. She was pretty good, but I stripped her and killed her. She was butchered shortly after this photo was taken.\"", "Who let the puppy in the Fridge", "I just insta kill cats/yorkies/rats/squirrels. But not turtles. Cuz turtles are neat.", "If she is a vegetable then is edible", "To be fair, every time I stub my toe in the dark, I too want to desecrate a corpse.", "\"I love how you talk so nicely about the girl you delegged so she can't act up during withdrawal.\"", "Is there a way to prevent married pawns from forcefully handholding prisoners?", "What would you do to inflict low brain damage on prisoners in a convenient way? Also does repeated brain damage increase chances?", "\"I try to keep [faction leaders] alive so they can mine in my Quarry in my mountain base in the dark light lit prison while their fed a steady diet of fungus and the meat from their comrades who died attacking me\"", "\"People who aren't cannibals just aren't hungry enough.\"", "“An obese nudist- why haven’t you turned that *thing* into a hat yet?”", "You misspelled organ farms.", "I always wanted to evolve my death camp in to a full on war crime.", "How to artificially impregnate when colonist has no lover/partner?", "\"The pact of anus, we’re in this shit together\"", "\"Ahh, I see you stopped breathing. Good! That will give your left lung some rest and time to heal over the bullet hole.\"", "How do you suppress legless slaves?", "Her body is in a frozen sarcophagus, so I still might thaw her out later. It worked for the seven dwarves.", "I’m really in love with the idea of accidentally eating a person bit by bit", "Two Grown Men Argue over Donkey Genocide in Rimworld", "just wait for her to die then feed her to your dogs or bury her. I suggest burying as feeding a human, even if they’re dead, is not really a “nice” thing to do.", "Dying is illegal and punishable by death", "Even just an Atrocity tab would be nice.", "Thats why we decided to save the hassle and turn dave into one of the armchairs in the rec room.", "The Revia race is so much fun because it rewards me for mass murder.", "Without paying money, but most the time 7 seconds is more than adequate.", "Torture a bad colonist or prisoner with lots of relations/family by killing and butchering all their family, decorating their room with their skin https://www.reddit.com/r/RimWorld/comments/9b0c99/torturing_pawns/", "There just isn't any way I'm gonna believe that my dog just felt like filling its stomach with bottled alcohol, or lit up 3 pounds of crack for breakfast.", "Draft one colonist to punch the mother in the stomach is always an option", "\"my slaves are running for mayor, how do I prevent this?\"", "I have a room or a tall shelf just filled with poppers", "Need help with mass organ harvesting", "\"My entire plan of levelling up Melee by beating masses of armless and (mostly) legless raiders silly is now potentially in jeopardy...\"", "I chopped off my sacrifices arms and legs and now they just lie around in the stable. I feel sort of bad about it", "\"I treat them like prisoners, but I don't chop their limbs off unless I'm feeling bored.\"", "Inspiration room for artists.", "The answer is clear. Meth. In extremely large quantities.", "You take the blue pill, you let the dromedary go, your wealth stays low and you can believe whatever you want to believe. You take the red pill, you stay in wonderland, and Randy will show you how little mercy he has.", "Should constant beating of prisoners be used to prevent prison break?", "I've got the Childhood and Pregnancy mod and it's quite dark when both of my 8yo colonists die to botched liver transplants for their cirrhosis.", "\"Warcrimes, bringing community together since 2016.\"", "Because she was old and no good sex...", "I will never kill my wolves. Never. They are way more helpful than half my colonists, so sorry guys but you are just gonna have to starve.", "\"Do people and animals prefer to eat the heads before the rest of the body?\"", "Wait, do you know if selling your mother into slavery would have a bad debuff", "Grammes for the new RibWorld expansion. We can now learn the difference between. - Let’s eat, kids. - Let’s eat kids.", "Honestly, torture is just how creative you get with it.", "I created a freaking concentration camp.", "\"My dog won't eat human corpses help!!!\"", "they damaged our fave pawn so now we are gonna imprison, beat up everyday and heal them for like a quadrum and once they are full of scars and broken bones, then remove one by one their organs in an order that will keep them alive so later we chop it and eat them", "As a future bargaining tip, [...] you can punch slaves one or two times to cause injuries and reduce their value before purchase.", "when Randy drops that \"Manhunter Squirrel\"", "I wish we could make gladiator pits for prisoners", "\"If they don't want to die, then they shouldn't run into the kill box. It's rather simple.\"", "Just slaughtered a woman and her 6 children", "Who the hell debug their modlist ? I though the procedure was to shrug off the ever growing red lines until fatal error.", "They do make for delicious chinchilladas though", "This is so sad can we replace her limbs with sticks?", "MY DOGS WONT STOP EATING LUCIFERIUM AND DRINKING ALCOHOL", "My guy took the body out and slapped it on the table where 3 others were having a nice breakfast. Body was only a couple days sour too. Those 3 guys got the hell out pretty quick after their appetites were rudely ruined.", "They're gonna eat the same thing as the panther: Kibble, and the corpses of people who argue with the panther.", "what's the chance of becoming immortal from eating a severed head?", "\"Arrest him make her the only warden until he has +100 opinion from talking to her then release him\"", "Let's put it to the test! We'll have the one that is capable of caring harvest some organs from the one that doesn't!", "Now, as I understand it, dingoes are partial to strawberries. Have you tried preparing the babies as Fine Meals?", "\"That is why you harvest their organs and make them eat their friends.\"", "How can I put someone into a coma?", "We have heartbreaks for breakfast, green goop for lunch and toxic fallout for dinner. Kindly leave your organs in storage before you die.", "The hat market is saturated with my enemies", "It only recognizes from what species it is. Not if it was from the leader’s wife.", "Selling is a waste. Butcher her and make a nice chair.", "\"Can't go berserk if you can't walk.\"", "I have recreated the Taliban in Rimworld!", "Does it just gift them the dollar value of the corpses?", "“I’m not memorializing a Robert”", "Won't be getting that human leather hat though... - Well, technically you're already wearing one over your skull...", "Also amputating the nose would be a good idea, since that smell of your decaying body will only give bad thoughts.", "I like how a domestic dispute is making the sub go \"dude\" and act all surprised how dark it is but we all play a game where you can harvest people's organs and cut off prisoner's limbs and free them to fend for themselves or make cowboy hats of their skin.", "remove said person legs and arms, let a rat in his room, if he eats the rat, he is free with peg-legs, if not, well, new food for the rat!", "Gary? Gary!", "“I wish animals can \"strip\" dead bodies after eating them instead of consuming them whole so this process can be automated without human resource.”", "Henry may be a slut, but he's a super useful slut.", "You don't have a stash of human jerky?", "I want to turn raiders I capture into mechanical abominations that I lobotomize and control like in Quake 2", "Today I learned vampirism doesn't cure brain damage", "The best way to treat mental illness is with physical violence", "\"This game needs slaves\"", "I'm pretty new to this game, close to 100 hours", "By the power of zyklon! B GONE!", "“60 people attending a marriage ceremony (ignore the blood, a fight broke out)”", "And thus randy saideth unto thee, “fuck you, take your potato back.”", "It could be quite cool to have a mod enabling prisoner torture.", "Kill him, butcher him, feed him to the other kittens and make an animal bed out of his skin.", "Greatly disfigure the guy. Everyone hates ugly people. Maybe even have the wife do the disfiguring to tragically change things between them.", "I once kept a prisoner alive by harvesting his limbs and organs then feeding them to him", "Joywires, my friend. Happiness is the only idea they can have.", "What I do, is any attacker who lives but I don't want to keep, I pull them into a triage room, treat their wounds without medicine just so they don't bleed to death before I can bleed them to death, and then harvest all their blood and store it for when fresh isn't available.", "\"He got even more brain damage from a turkey\"", "I mean I would read their backstories and dive into the lore and all that, but they're incapable of hauling, suffer from dementia and I'm already dealing with an infestation, half my base is on fire and the dogs are drunk again.", "I don’t make hats out of people. I capture them, make sure they have no legs so they can’t run and cook them on a slow heat for 2 hours. Then burn some fire to the sides for that extra crispyness.", "Set up an economy based on renewable resources. I make drugs", "I like the pattern on your duster.", "Will Slaves Attack You When You Attack Their Owners? • r/RimWorld", "And like that all the war crimes never happened", "(about wild humans) I wish you could catch two of them and farm humans like this in a cannibalism colony...", "Sugestion: People should very slowly get used to seeing rotten corpses, dying prisoners, or maybe even mental breaks", "So you're saying that I can dig up the corpses of my enemies, reanimate them and then kill them again? Interesting...", "\"Your doctors gotta have some pretty fucked up kinks. I bet he pokes her in the spot where one of her kidneys were.\"", "“Housekeeping is in a shallow grave dug with a tribal’s femur.”", "'This guy sounds like he'd be a very tasty meal\"", "I don't get the appeal either but hey, I eat people so who am I to judge.", "Well if you can't kill your dogs, you could try processing human meat into kibble.", "A pair of pants made from the skin of a dead man or woman...", "\"draft a couple of people, station them in the research room with food, forbid the door, and watch science happen.\"", "\"Sometimes I get upset at them and just remove all the tables. They can all eat on the floor for all I care... I mean they do it anyways.\"", "“Hmm maybe that’s not an eye patch. I should gouge the eyes of multiple races to find an answer”", "So every day those guys had to watch their friend get harvested and then put back together.", "I've recently begun beating people with logs and so far it's been a great success.", "My cat overdosed on cocaine (yayo) • r/RimWorld", "Slavery is fine with me, but this seems unethical?", "I thought having two timber wolves as pets would be nice, now they're taking over my colony", "In my last playthrough, I had a charge rifle with art depicting a chicken freezing to death. It was awesome.", "By that point though, they're no longer prisoners. They're live shish kebab.", "Naw, man. We got human leather chairs for that. It's just that Onesan dumped a rotten corpse on the table the other day and everyone was pissed about it because apparently Blue never got around to butchering it in time. Oh, you never met Blue. You're sitting on him right now.", "So I recruited an invader, but he's paralyzed and has chemical damage. So I harvested his organs... I think one of my guys are eating them?", "“Oh sweet I forgot domestic violence was an option”", "Never too early to learn about war crimes!", "Everything in this thread pretty much...especially \"Nerve spaghetti with a garnish of marrow sauce. And some of those little green \"herb\" things that the Italians throw on all their pasta.\"", "It's all fun and games until a squirrel chews your eye off.", "Don't worry, we have a shoot on sight policy with furries", "I have discovered that I can save 200W by letting the cows instead starve to death before sucking them down the chute.", "\"So basically I had a guy that everyone hated so much that my entire colony is happier specifically because he died.\" -- \"That's a great way to deal with a difficult colonist!\"", "I have a few questions regarding cannibalism and incest", "Raids are my only Foodsource, is there any way to get more of them?", "Can a vegetable have a child", "She harvested her mom's heart while on coke", "well then... \"It's ok, his human skin teddy bear will keep him company\"", "I was down to 1 finger and 2 toes before I forgot about him and he froze to death.", "I like to imagine the boars engaged in a decade long incestuous orgy under the watchful eyes of two dozen turrets and then emerged, 10,000 strong, and conquered the planet.", "How I quickly turned into a slave trading kingpin", "She's a 38 year old model. She's probably used to eating tasteless paste and he's giving her something to do that she's passionate about. Sounds like a good retirement to me.", "\"How can I pollute as much as possible?\"", "So naturally I harvested his penis and his organs and fed him to the dogs.", "My colonists became egg shitting milk providing walking animals. 10/10 would recommend.", "Maybe systematically murdering your ugly, useless colonists that nobody likes could be one way to make all the important, attractive colonists that little bit happier.", "It turns out that chemical warfare is quite frowned upon on the rimworld.", "Well, it seems you wear the human leather pants in this relationship.", "Advice for a nudist on an ice sheet?", "Fat people should provide more meat and leather when butchered", "Has ideology turned anyone into a blooothirsy man-eater with a constant lust for human flesh?", "Lucky for him, there is no predators; they've been taken out by prey animals.", "\"Should I install a bionic vag?\"", "“Drug fueled alpaca spreading diseases”", "If you've got a wedding, empty your prison: harvest everything and butcher the corpses, human leather is still a very good leather to sell", "My balls were shot off. Any way to get them back?", "Cowboy hats : now made with real cowboys!", "Throwing away pregnant minor", "Where is my lung?", "I just harvested my cunts for organs and buried them.", "“Whats the difference? Friends are just emergency rations”", "So far 3 have died of repeated brain damage, it should only be a matter of time until I get trauma savants", "Eating people is just a normal thing that everyone should try. Besides, flesh is healthier than vegetables anyways.", "It's ok, she gave birth so I finally slaughtered her", "I would jump for joy when I got the raider warning. It's like an oven timer shouting here comes food and cloths and guns.", "\"Whenever I have a masochist that's upset, I just shoot them. Works like a dream\"", "Meet Dumbo the perfect happiness emitter", "If I put drugs in my prison cells, will prisoners take them?", "I’ve seen a strong bias towards fondling bushes when a nudist is in the colony.", "At what point is killing self-centered chicks the best option.", "Also, what percentage of malnutrition is required to miscarry?", "Haven't committed any crimes yet, but do have a ton of drugs (thanks Randy) so making a \"reformation camp\" isn't gonna be too bad on morale.", "For me all my cats are constantly getting drunk and at one point had an alcoholic squirrel.", "\"well, over here we have an excellent collection of hats. they're made from our slaves, by our slaves...\"", "\"Your fault, your body is meat, checkmate.\"", "People can eat other people, as either raw corpses or butchered for meat. Wouldn't the harvested organs be a delicacy for cannibals, or something?", "best way to efficiently brain damage guinea pigs", "Where is my kidnapped infant??", "I want to know how I can muddy waters, making it full of blood, oil, and ruin my landscape to the horror of guests coming in for a visit.", "\"Hey, man. I don't judge you and your colonist backstabbing, you don't judge me turning my prisoners into milk-producing suicide bombers.\"", "What about a couch slot that adds an extra 2 comfort to it because of the softer baby leather", "\"If live gives you prisoners, get their organs and make hats with them!\"", "Is there a mod that allows you to use your prisoners as sex slaves for a mood boost?", "so if you cant handle a little harmless amputation and torture what can you handle?", "Basement goblin", "Sacred words: Thou shalt not snort coke. Thou shalt not butcher thy friend's dog. Thou shalt keep thy dick out of thy neighbor's wife. Thou shalt not set fire to the cat. Thou shalt not get out of thine cell.", "So the obvious question is, what's better than one slave? How about a slave with bionic arms and legs on a schedule of work from 0h to 24h enabled by forced consumption of copious drugs?", "Remove the roof of your prison during Toxic Fallout to give prisoners cancer and dementia", "I should have known leaving a grizzly bear in the hospital was a bad idea...", "I think rimjobs caused this.", "Realized is still out of commission at this current point in time due to a certain jihad squirrel.", "I like how there's a big comfy couch in front of the crematorium. Might as well be comfortable while burning bodies.", "Things like this make me feel like I missed out on a fun story line when I let my dogs finish off that gay night-owl nudists body.", "Well, it's a harsh world on the Rim and sometimes you just gotta bite a man's penis while \"social fighting.\"", "\"Life is precious :D but human skin hats are more precious\"", "\"If your goal is maximize human suffering, well, you use them as medical practice.\"", "So my prison labor camp has seen it's share of weird stuff, but this is something that I've never seen (or heard of) before and I'm looking for some help.", "How to harvest organs from prisoners?", "That is the answer to any misbehaving pawn, really. You fuck up you lose leg privileges.", "Up their medical treatment quality, prioritise bed-rest and make sure your doctor isn't stoned.", "When you shoot your sister in the face with a shotgun because its the 6th day you've eaten on the floor", "It's what inside that counts: their organs, waiting to be harvested.", "Terriers are also basically cats", "\"There's something extra gratifying about removing someone's testicles\"", "Is there a mod for a hose weapon? We're already pretty far into Buffalo Bill territory.", "A cthulhu-worshipping cat person with a rainbow sword. All it needs now is a bionic dog and several thousand dead prisoners.", "I would like a mod where after being beaten, anyone is willing to do any job for a while (though they may have a huge negative on skilled tasks they have no training at).", "*LOSES ARM* Joe: Oh yeah we look reasonable, after all, all we do is chop a few legs off... Maybe a kidney... We even have tables!", "Dude like I get that times are tough, but did you have to carve up his dead cat 5 minutes after it overdosed on hardcore drugs?", "Just turn [the baby] into food for the colonists that DON’T make annoying sounds."]